[
    {
        "latin": "Pelargonium graveolens",
        "common": "Rose geranium",
        "description": "The rose geranium (*Pelargonium graveolens*) is a shrub native to some nations in South Africa. The plant is desirable to many for its decorative purposes - attractive white to pink flower clusters and fruits that resemble that of a stork’s long beak. The plant leaves produce economically valuable rose-smelling essential oil for the perfume industry.",
        "watering": "Every 1-2 weeks",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Summer, Fall",
        "soil": "Sand, Loam, Chalky, Slightly acidic, Neutral, Alkaline",
        "wateringDetail": "Water Rose geranium whenever the first inch of soil dries out. Frequency will change for outdoor plantings depending on weather conditions. Make sure that the substrate drains well after watering, as this plant gets root rot easily.",
        "fertilization": "Give rose geranium a half-strength feeding of balanced, water-soluble fertilizer starting in mid-spring. Repeat every three weeks through summer if the plant is still establishing or is not thriving.",
        "toxicity": "Toxic to Pets",
        "folder_num": 1355932
    },
    {
        "latin": "Cirsium arvense",
        "common": "Creeping thistle",
        "description": "This aggressive weed spreads across grasslands and fields via underground roots that creep horizontally, some for more than 5 m. It can cause major problems to agriculture if its growth is left unchecked. Its seeds feed many birds as well as pest insects. Creeping thistle is generally considered a noxious weed even in its native territory.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Fall",
        "soil": "Sand, Chalky, Acidic, Neutral, Alkaline",
        "wateringDetail": "Moisture-loving, keep the soil moist but do not let water accumulate.",
        "fertilization": "",
        "toxicity": "Toxic to Humans",
        "folder_num": 1355936
    },
    {
        "latin": "Cirsium vulgare",
        "common": "Bull thistle",
        "description": "Bull thistle (Cirsium vulgare) is a thistle plant native to Europe, Africa, and Asia. Bull thistle produces a large amount of nectar and attracts pollinators. Bull thistle is considered a noxious weed in areas of Europe and Australia.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Late winter, Early spring",
        "soil": "Sand, Loam, Acidic, Neutral, Alkaline",
        "wateringDetail": "Bull thistle has average watering needs. This plant should be watered regularly during the spring and summer seasons and less during the dormant winter season. It should not be overwatered.",
        "fertilization": "Bull thistle grows more commonly in the wild than it does in cultivation, and does not need to be fertilized in order to grow well. Even without any fertilization, this plant tends to develop and spread easily.",
        "toxicity": "Toxic to Humans",
        "folder_num": 1355937
    },
    {
        "latin": "Mercurialis annua",
        "common": "Annual mercury",
        "description": "Annual mercury (Mercurialis annua) is a flowering plant that is native to North Africa, Europe, and the Middle East but has also been introduced in many other places around the world. Annual mercury grows easily in a variety of environments, including areas disturbed by human activity.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1355990
    },
    {
        "latin": "Hypericum perforatum",
        "common": "Common St. John's wort",
        "description": "Common St. John's wort (*Hypericum perforatum*) is a plant species that is native to Europe and Central Asia. Common St. John's wort is considered poisonous to livestock and can cause problems for humans if consumed. This dense, fast-growing plant has been introduced to North America and Australia, where it is often viewed as an invasive species.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Late fall, Winter",
        "soil": "Sand, Clay, Loam, Chalky, Acidic, Neutral, Alkaline",
        "wateringDetail": "Common St. John's wort is a drought-tolerant plant that can also withstand soggy feet, but it will grow best when supplied with consistent moisture. It's best to water the soil deeply and then let it mostly dry out again before giving it more water, or use an irrigation system.",
        "fertilization": "Provide common St. John's wort with an annual supply of balanced granular or compost fertilizer. If using liquid fertilizer, apply 3 to 4 times starting in late spring and ending in midsummer. Be sure to apply it directly to the soil and avoid getting it on any part of the plant.",
        "toxicity": "Toxic to Human & Pets",
        "folder_num": 1356022
    },
    {
        "latin": "Tradescantia fluminensis",
        "common": "Small-leaf spiderwort",
        "description": "Tradescantia fluminensis is a ground cover plant that is most commonly found as a houseplant. This plant has oval leaves that are dark green and glossy. It will root anywhere a node is on the surface, which earns it some of its other common names, like wandering Willie and wandering gypsy.",
        "watering": "Every week",
        "sunlight": "Partial sun",
        "plantingTime": "Early spring",
        "soil": "Loam, Sand, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "Small-leaf spiderwort likes to be watered once a week, or when the top 1 inch of soil has dried out. Allow the water to drain from the pot as this plant does not like sitting in water. It will require less water during the winter months.",
        "fertilization": "Small-leaf spiderwort does not need fertilizer but it will benefit from it and bloom brilliantly. A diluted liquid fertilizer for houseplants once or twice a month is all that is required.",
        "toxicity": "Toxic to Pets",
        "folder_num": 1356075
    },
    {
        "latin": "Melilotus albus",
        "common": "White sweetclover",
        "description": "White sweetclover (Melilotus albus) is a flowering herbaceous plant also known as white melilot and honey-clover. White sweetclover is a sweet-scented herb. The leaves of this species are divided into three leaflets and have small, sharp teeth.",
        "watering": "Every week",
        "sunlight": "Full sun, Partial sun",
        "plantingTime": "Spring",
        "soil": "Sand, Loam",
        "wateringDetail": "Average water needs,watering when the top 3 cm of soil has dried out.",
        "fertilization": "Fertilization once every 2-3 months during the growing season.",
        "toxicity": "",
        "folder_num": 1356257
    },
    {
        "latin": "Dryopteris filix-mas",
        "common": "Male fern",
        "description": "Male fern thrives in part to full shade, which makes it a nice choice for understandings, or areas that don't get enough sun for other plants to thrive. This graceful plant grows in clumps, will return year after year, and is resistant to rabbits.",
        "watering": "Twice per week",
        "sunlight": "Partial sun",
        "plantingTime": "Spring",
        "soil": "Sand, Loam, Acidic, Neutral, Alkaline",
        "wateringDetail": "Male fern requires a good supply of moisture, so do water regularly. Test the topsoil first, however, as the first 1 inch or so of soil should have gotten dry before it's really time to water again. Although this plant likes to stay evenly moist, it can tolerate drought.",
        "fertilization": "It is advisable to fertilize the male fern using fish or seaweed fertilizer for plants. You should apply fertilizer once every two weeks. Typically, they do better with organic fertilizer and compost.",
        "toxicity": "",
        "folder_num": 1356382
    },
    {
        "latin": "Humulus lupulus",
        "common": "Common hop",
        "description": "Common hop is a perennial climbing vine that grows up to 6 m tall. Hops are an essential ingredient in beer brewing due to their bitter flavor and aromatic qualities. Interestingly, common hop contains a compound that acts as a natural sedative, making it a popular ingredient in herbal remedies for insomnia and anxiety. Common hop also has a unique feature of being able to rapidly grow up to 20 cm per day during the growing season, making it an impressive sight in gardens and the wild.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Summer",
        "soil": "Sand, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "Common hop plants need lots of even, consistent moisture, especially during the summer months. Allow the top of the soil to slightly dry before each watering, and avoid spraying water on top of the plants, to prevent disease and pests. Try not to waterlog the soil or you may drain away essential nutrients.",
        "fertilization": "Nitrogen is the essential nutrient for growing healthy common hop plants. In the early summer, apply a small amount of nitrogen-rich fertilizer 15 cm away from the base of each vine. You can also add compost in the spring to help restore the soil.",
        "toxicity": "Toxic to Humans",
        "folder_num": 1356781
    },
    {
        "latin": "Calendula officinalis",
        "common": "Pot marigold",
        "description": "The pot marigold is a herbaceous perennial plant often recognized by its thick, orange-yellow blooms with numerous petals. Flowers of the pot marigold have a long history of table use. They are often served in salads or as a decoration. The flowers can also be made into a similarly-colored dye for foods, textiles, or cosmetic products.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Fall",
        "soil": "Clay, Chalky, Sandy loam, Acidic, Neutral, Alkaline",
        "wateringDetail": "Water Pot marigold once a week on average, when the soil surface dries out. Give a good soaking but make sure that the soil drains thoroughly. Pot marigold will require less water during winter.",
        "fertilization": "Mix a generous helping of compost or all-purpose fertilizer into the soil when you plant pot marigold. Adding a phosphorous-rich fertilizer will encourage flowering. However, pot marigold does not require any fertilizer to thrive.",
        "toxicity": "",
        "folder_num": 1357330
    },
    {
        "latin": "Helminthotheca echioides",
        "common": "Bristly oxtongue",
        "description": "This tall member of the Asteraceae family, bristly oxtongue, or Helminthotheca echioides, is often found along roadsides and other wasted spaces. It is known as oxtongue because its leaves feel like an ox’s tongue. This short-lived perennial is not registered as toxic but is not known to be edible, either.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1357635
    },
    {
        "latin": "Sedum acre",
        "common": "Goldmoss stonecrop",
        "description": "The goldmoss stonecrop is a flowering perennial with star-shaped flowers. It is commonly used in hanging baskets and other container gardens as groundcover and trailing accents. Because of its spicy and peppery flavor, the leaves and stems of this plant are used as flavor enhancers in some recipes.",
        "watering": "Every 2-3 weeks",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Fall",
        "soil": "Sand, Loam, Chalky, Clay, Acidic",
        "wateringDetail": "Goldmoss stonecrop is the ultimate low-maintenance plant since it is so well-adapted to dry conditions that it doesn't require any supplemental watering, even in times of drought. If the plant is grown in exceptionally dry locations, like on stone walls, then it is a good idea to spray it with water, very occasionally, but otherwise, it can be left to its own devices.",
        "fertilization": "Goldmoss stonecrop is an unusual plant that is so well-adapted to barren soils that it can actually be harmed by fertilizers, which cause its shoots to lose rigidity. The plant really does not need any artificial fertilization although the monthly application of a specialist succulent fertilizer during the growing season will not harm it.",
        "toxicity": "",
        "folder_num": 1358094
    },
    {
        "latin": "Sedum album",
        "common": "White stonecrop",
        "description": "White stonecrop (Sedum album) is a flowering plant species that often grows in crevices or free-draining rocky soil. White stonecrop grows in temperate regions all over the world. It is adapted to grow in dry, thin soils and is often found growing on walls, dry banks, seashore rocks and in rocky meadows. This species grows low to the ground and cannot compete when there are other, fast-growing species in the same area.",
        "watering": "Every 2-3 weeks",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Loam, Chalky, Acidic, Neutral, Alkaline",
        "wateringDetail": "White stonecrop is incredibly drought tolerant with sharp drainage being the most important factor of the soil. To check if your White stonecrop needs water, test the soil by inserting your finger a few inches below the surface. If it feels dry, give it water. Overwatering will cause the roots to rot.",
        "fertilization": "White stonecrop does not usually need fertilizer to thrive and survive, however, a handful of all-purpose dry, granular fertilizer every spring will help things along. This should be watered into the soil. If your white stonecrop is growing in rich soil, reduce feed to once every two years.",
        "toxicity": "",
        "folder_num": 1358095
    },
    {
        "latin": "Sedum sediforme",
        "common": "",
        "description": "",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1358133
    },
    {
        "latin": "Hypericum androsaemum",
        "common": "Tutsan",
        "description": "Tutsan (Hypericum androsaemum) is related to the more common St. John's Wort. It is native to Europe, Iran, and the Mediterranean region. This fast-growing plant is considered invasive in some countries - particularly in Australia where neither livestock nor any wild animals will eat it.",
        "watering": "Every 1-2 weeks",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Fall",
        "soil": "Loam, Clay, Sand, Chalky, Acidic, Neutral",
        "wateringDetail": "Water Tutsan plants deeply once the first two inches of soil dries out. Timing will vary for outdoor plants depending on recent weather patterns. Make sure that the soil drains properly to avoid root rot.",
        "fertilization": "Work compost, aged manure, or time-released, balanced fertilizer into the soil around tutsan plants every spring. Follow up with a helping of balanced liquid fertilizer once a month during growing season.",
        "toxicity": "",
        "folder_num": 1358689
    },
    {
        "latin": "Lamium purpureum",
        "common": "Purple dead-nettle",
        "description": "Purple dead-nettle (Lamium purpureum) is an herbaceous annual weed, commonly found in meadows, wastes, gardens, and at the edges of roads and woodlands. Though it appears similar to true nettles, purple dead-nettle gets its name because it does not have \"live\" nettle poison that harms the skin. It originated in Asia and prefers environments with full sun.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Early spring",
        "soil": "Sand, Clay",
        "wateringDetail": "Moisture-loving, keep the soil moist but do not let water accumulate.",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1358752
    },
    {
        "latin": "Lavandula stoechas",
        "common": "Topped lavender",
        "description": "The evergreen- topped lavender shrubs' flowers bloom in spring and summer, attracting bees and butterflies. They do well in landscaping or in pots. The flowers and leaves are fragrant and can be used for potpourri and essential oil. Interestingly, they also find use in insecticides.",
        "watering": "Every 1-2 weeks",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Fall",
        "soil": "Sand, Loam, Chalky, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "Topped lavender is prone to well-drained soils of dry to medium moisture. However, as it loves to be in full sun, gardeners may need to water regularly to retain moisture as topped lavender is sensitive to the heat.",
        "fertilization": "Topped lavender is sensitive to the use of fertilizer and may excessive nutrients will cause the plant to break apart. When needed, topped lavender can be treated with balanced time release fertilizer. Compost and worm casings can also be used, but mature plants should not be fertilized.",
        "toxicity": "",
        "folder_num": 1358766
    },
    {
        "latin": "Trifolium incarnatum",
        "common": "Crimson clover",
        "description": "Crimson clover (Trifolium incarnatum) is commonly planted for aesthetic purposes, to prevent soil erosion, or to suppress weeds during a crop field's fallow season. It is also a good source of forage for ruminants like cattle. Care must be taken in garden settings, however, since crimson clover will often overgrow and eliminate other species of plants in locations where it is planted.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Summer, Fall",
        "soil": "Sand, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "Crimson clover likes a lot of moisture, but does not do well if waterlogged. Keep its soil moist during the growing season, replenishing it when the soil surface dries out but making sure that the water drains properly.",
        "fertilization": "Crimson clover doesn't need much in the way of fertilization. If soil is poor, amend prior to planting and yearly thereafter in late fall with compost and well-rotted manure.",
        "toxicity": "",
        "folder_num": 1359498
    },
    {
        "latin": "Trifolium pratense",
        "common": "Red clover",
        "description": "Red clover is widely cultivated as a fodder plant and green manure because its roots can fix nitrogen and increase the fertility of the soil. The cultivated Trifolium pratense is inevitably escaped and is now naturalized globally, including the United States and Australia. Its flowers are attractive, so it is also cultivated as an ornamental plant.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Summer",
        "soil": "Clay, Loam, Sand, Chalky, Acidic, Neutral",
        "wateringDetail": "Seedling Red clover plants will need to be well-watered right as they're being germinated, but they establish themselves quickly and become drought-tolerant once they do. Unlike many other clovers, Red clover doesn't do well in overly-wet conditions. Once mature, it should only get supplemental water if you're experiencing a long stretch of hot or dry weather.",
        "fertilization": "Red clover is a nitrogen-fixing plant that actually does best when not given any fertilizer. The only exceptions may be if your soil is extremely deficient in one or more nutrients (e.g., phosphorus), in which case small amounts of specially-formulated fertilizer may be appropriate.",
        "toxicity": "Toxic to Humans",
        "folder_num": 1359517
    },
    {
        "latin": "Punica granatum",
        "common": "Pomegranate",
        "description": "Pomegranate (Punica granatum) is a deciduous shrub or small tree, native to western and southern parts of Asia. It has a long history of cultivation and rich symbolism in polytheistic religions. Fruits of pomegranate play an important role in many West Asian cuisines. Aside from culinary uses, this fruit-bearing shrub is also cultivated for ornamental purposes.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Fall",
        "soil": "Sand, Loam, Chalky, Clay, Alkaline",
        "wateringDetail": "Though Pomegranate is relatively drought-tolerant, it still needs regular moisture in order to produce fruit. Regular watering is crucial for young plants that haven't developed a strong root system yet. Pomegranate prefers deep watering that allows the entire root system to get soaked.",
        "fertilization": "In its first year, mulch your pomegranate with manure or garden compost. Starting the second year, apply a balanced granular fertilizer in spring, especially if your soil lacks vital nutrients. Avoid applying the fertilizer directly to the trunk.",
        "toxicity": "",
        "folder_num": 1359616
    },
    {
        "latin": "Alcea rosea",
        "common": "Common hollyhock",
        "description": "Common hollyhock (Alcea rosea) is a stalk-flowering plant known for its height and attractive flowers. It regularly reaches head height or beyond - from 1.5 to 2.5 m tall. The presence of common hollyhock in a garden can also attract butterflies and hummingbirds.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Fall, Spring",
        "soil": "Loam, Sand, Chalky, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "Common hollyhock is not very drought-tolerant, even after the roots are well-established. New plantings will require consistent, deep waterings every week or so. As they mature, they won't require as much water in the off-season, but they'll remain plenty thirsty while they're flowering. Keep soil moist with weekly waterings, and water even more frequently during periods of heat or drought.",
        "fertilization": "Common hollyhock will produce colorful, vigorous blooms when grown in nutrient-rich soil. A balanced, slow-release fertilizer can be added around the base of the plant in late spring and in early fall; if your soil is particularly poor or you'd like to encourage additional growth, you may also fertilize several times during the primary growing season.",
        "toxicity": "Toxic to Humans",
        "folder_num": 1359620
    },
    {
        "latin": "Pancratium maritimum",
        "common": "Sea daffodil",
        "description": "Sea daffodil (Pancratium maritimum) is a bulbous perennial species native to the Canary Islands, the Mediterranean region, and the area surrounding the Black Sea. The sea daffodil grows on beaches and coastal sand dunes. This species is often cultivated as an ornamental plant and requires full sunlight and well-drained soil to grow well.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1360978
    },
    {
        "latin": "Ophrys apifera",
        "common": "Bee orchid",
        "description": "The bee orchid (Ophrys apifera) is native to Europe. To attract the bees that pollinate it, the plant emits a scent like that of the female bee. The brown, velvety lip of the flower has yellow markings which make it look like a bee, and as the male bee attempts to mate with it, pollen is transferred.",
        "watering": "Every 1-2 weeks",
        "sunlight": "Partial sun",
        "plantingTime": "",
        "soil": "Sand, Loam, Chalky, Clay, Moderately acidic, Slightly acidic, Neutral, Alkaline",
        "wateringDetail": "Average water needs,watering when the top 3 cm of soil has dried out.",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1361656
    },
    {
        "latin": "Lamium galeobdolon",
        "common": "Yellow archangel",
        "description": "Yellow archangel (Lamium galeobdolon) is a wildflower native to Europe. Yellow archangel is considered invasive in certain areas because it spreads rapidly. It is banned for sale in Washington state because it is considered a noxious weed in that region.",
        "watering": "Every week",
        "sunlight": "Partial sun",
        "plantingTime": "Spring",
        "soil": "Sand, Chalky, Acidic, Neutral, Alkaline",
        "wateringDetail": "Yellow archangel likes plenty of water so don't hold back on regular watering in the spring-to-fall growing season. It is important that the soil doesn't become waterlogged, and the plant can tolerate a little drought, but it prefers damp soil. In the winter this regime can be scaled down so that the soil surrounding the plant is kept just barely moist.",
        "fertilization": "Yellow archangel is a relatively self-sufficient plant that can derive most of its nutrient needs from a reasonably rich soil. The best method to keep the plant well-fed is to apply a layer of organic fertilizer such as mulch to the soil every spring to keep it fertile.",
        "toxicity": "",
        "folder_num": 1361823
    },
    {
        "latin": "Lavandula angustifolia",
        "common": "English lavender",
        "description": "The english lavender is a common flowering plant originally native to the Mediterranean region. Today, it is often used in scented products such as candles, oils, perfumes, soaps, and house sprays. The scent also has a deterrent effect against clothing moths.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Fall",
        "soil": "Sand, Chalky, Loam, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "Like many other lavender varieties, English lavender is quite drought tolerant. When first becoming established, new plants need regular waterings for a few months. Once mature, however, rainfall should provide sufficient water, unless you live in an exceptionally hot or dry area. It's far easier to overwater than to underwater 鈥?these plants prefer to be kept in well-drained soil and are susceptible to root rot and other diseases if overwatered.",
        "fertilization": "English lavender thrives in poor soils and can actually be damaged by overfertilization. Most gardeners will find their english lavender does fine with no supplemental feedings at all. If you do feel your plants could use a little boost, though, spreading a small amount of compost on your soil at the beginning of the growing season can do the trick. You can also feed with a balanced fertilizer in spring, just be sure to use it sparingly.",
        "toxicity": "Toxic to Pets",
        "folder_num": 1361824
    },
    {
        "latin": "Sedum rupestre",
        "common": "",
        "description": "",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1362490
    },
    {
        "latin": "Papaver rhoeas",
        "common": "Corn poppy",
        "description": "The corn poppy (Papaver rhoeas) is an annual flower that carries great symbolism in many cultures. During World War One, the corn poppy could be found blooming between trenches in France and Belgium; afterwards, it became an international symbol of fallen soldiers. This poppy does not produce opium.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Winter, Spring",
        "soil": "Sand, Loam, Chalky, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "Corn poppy needs to be placed in well-drained soils. Gardeners should water occasionally to maintain medium moisture. It has low water requirements which makes it low maintenance. However, it is intolerant of sodden soils and drought.",
        "fertilization": "Corn poppy can be weedy and may not require fertilization. However, the absence of flowers and abundance of foliage may suggest too much nitrogen in the soil. Gardeners can support bloom growth with phosphorus rich fertilizer.",
        "toxicity": "Toxic to Humans",
        "folder_num": 1363128
    },
    {
        "latin": "Papaver somniferum",
        "common": "Opium poppy",
        "description": "Opium poppy (*Papaver somniferum*) was first cultivated approximately 5,400 years ago by the lower Mesopotamians. The Sumerians called it “Hul Gil,” which means the “joy plant.” It is used in the production of medical painkillers. The tiny seeds are commonly added as a topping on bread buns, but most portions of the plant are toxic if eaten.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Fall",
        "soil": "Sand, Loam, Chalky, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "Opium poppy is an extremely drought-tolerant plant that is accustomed to growing in arid habitats, so it doesn't need much additional water except in times of severe drought. When young, the plant benefits from a fine-mist watering, but when mature, it only requires supplementary watering when grown in containers or when the soil completely dries out.",
        "fertilization": "Studies have shown that opium poppy benefits from the application of a split dose of nitrogen-rich fertilizer. The first application should occur at the start of the growing season, and the second application at the time of flowering.",
        "toxicity": "",
        "folder_num": 1363130
    },
    {
        "latin": "Daucus carota",
        "common": "Wild carrot",
        "description": "The wild carrot is a common flowering plant with light, delicate flowers. Originally native to Europe and Asia, it has also spread to North America and Australia. Studies of historical paintings suggest that the wild carrot was cultivated in Turkey, Spain, and North Africa for centuries.",
        "watering": "Twice per week",
        "sunlight": "Full sun, Partial sun",
        "plantingTime": "Spring, Fall",
        "soil": "Sand, Chalky, Acidic, Neutral, Alkaline",
        "wateringDetail": "Wild carrot requires approximately 2.5cm of water a week, either through rainfall or irrigation. If irrigating, use a drip irrigator or soaker hose as Wild carrot prefers a slow deep soak. Try to water in the morning and ensure that the soil is thoroughly moist for the full moisture benefit.",
        "fertilization": "If the soil is fertile, your wild carrot will survive without fertilizer. Once the carrot tops reach 8 cm, apply a granular fertilizer at 50% of the manufacturer’s recommendation. Try to use a low nitrogen but high potassium or phosphate product. Once applied, water well.",
        "toxicity": "",
        "folder_num": 1363227
    },
    {
        "latin": "Smilax aspera",
        "common": "Rough bindweed",
        "description": "Rough bindweed (Smilax aspera) is a climbing evergreen vine that is native to the Mediterranean, parts of Asia, and central Africa. Its yellowish-green flowers mature into red berries, which then darken until they become nearly black. The berries are an important food source for wild birds.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1363336
    },
    {
        "latin": "Trifolium repens",
        "common": "White clover",
        "description": "White clover (Trifolium repens) is a perennial herb, one of the most cultivated species of clover. It can be found on lawns and grasslands all over the world. White clover is often cultivated as a forage plant and used for green manure in agriculture.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Summer, Fall",
        "soil": "Sand, Loam, Clay, Chalky, Acidic, Neutral, Alkaline",
        "wateringDetail": "White clover will flourish in moist soil although it can tolerate dryer ground. Seedlings should be watered daily for the first few weeks of their lives. Once established, water the plants twice a week depending on the weather and soil type.",
        "fertilization": "White clover does not need to be fertilized as it is a nitrogen-fixer itself.",
        "toxicity": "",
        "folder_num": 1363740
    },
    {
        "latin": "Acacia dealbata",
        "common": "Silver wattle",
        "description": "It is a fast-growing evergreen tree or shrub growing up to 15 m tall. The leaves are blue-green to silvery gray and thinly divided, which makes them attractive all year long. The flowers of the silver wattle are bright balls of color made up of yellow flowerheads of 13–42 individual flowers.",
        "watering": "Every 1-2 weeks",
        "sunlight": "Full sun, Partial sun",
        "plantingTime": "Spring, Fall",
        "soil": "Sand, Acidic, Neutral",
        "wateringDetail": "Drought-tolerant. Allow the soil to dry completely between watering.",
        "fertilization": "Silver wattle can grow well even without fertilizer, as long as it grows in rich soil. To supplement poor soils or encourage even better growth, you can add organic fertilizer or compost such as worm castings or banana peels. Apply the fertilizer every few months from spring to fall, spreading the solution on the soil around the edges of the roots and watering it directly after.",
        "toxicity": "",
        "folder_num": 1363764
    },
    {
        "latin": "Fragaria vesca",
        "common": "Woodland strawberry",
        "description": "Woodland strawberry is a plant that spreads by runners that put down roots as they go. This ever-bearing strawberry produces fruit all year long that is small but edible. Because the fruit is so small, cultivated woodland strawberry is typically used more as an ornamental or ground cover.",
        "watering": "Every week",
        "sunlight": "Full sun, Partial sun",
        "plantingTime": "Mid winter, Late winter, Early spring, Mid spring",
        "soil": "Loam, Clay, Sand, Chalky, Sandy loam, Alkaline",
        "wateringDetail": "Woodland strawberry is a reasonably drought-tolerant plant that requires around 2.5 cm of water per week during the growing season. If there has been little or no rainfall and the soil is beginning to dry then supplement to reach this amount, especially in the plant's first year of growth when its water needs are a little greater.",
        "fertilization": "Woodland strawberry benefits from fertilization. A balanced fertilizer should be applied once a year after fruiting and care taken to ensure none remains on the leaves. One option is to use a fertilizer high in potash, which can improve the plant's yield in future years.",
        "toxicity": "",
        "folder_num": 1363991
    },
    {
        "latin": "Centranthus ruber",
        "common": "Red valerian",
        "description": "Red valerian (Centranthus ruber) is a perennial shrub that is comfortable in alkaline conditions and can even be found growing from limestone mortar in castle walls. Its leaves and roots are occasionally incorporated into salads or made into soup. But these plants are red valerian should not be confused with true valerian and has no demonstrated medicinal value.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Sand, Loam, Chalky, Neutral, Alkaline",
        "wateringDetail": "Red valerian grows in soils of medium moisture. Once established, the red valerian is drought tolerant and can withstand periods without water. However, gardeners should be careful about overwatering.",
        "fertilization": "Fertilization once every 2-3 months during the growing season.",
        "toxicity": "",
        "folder_num": 1364099
    },
    {
        "latin": "Tagetes patula",
        "common": "Tagetes patula",
        "description": "Tagetes patula (Tagetes patula) are bright yellow plants from Mexico that spread to Europe in the 16th century, where they are still a garden-bed favorite. In Mexico, tagetes patula are used in the yearly Day of the Dead celebration and are considered the bloom of the dead. When grown around vegetable gardens, they can repel insect and animal pests with their odor.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1364159
    },
    {
        "latin": "Lapsana communis",
        "common": "Common nipplewort",
        "description": "Common nipplewort (Lapsana communis) is a flowering plant related to sunflowers. Common nipplewort grows throughout Europe, Asia, and North America. Common nipplewort is edible and can be cooked like spinach. The name common nipplewort comes from the plant's flower buds, which resemble this part of the anatomy.",
        "watering": "Every week",
        "sunlight": "Partial sun, Full sun",
        "plantingTime": "Early spring",
        "soil": "Loam, Clay, Neutral",
        "wateringDetail": "Common nipplewort should be watered regularly during establishment and only occasionally after it is established. This species can withstand moist and dry soil conditions and does not need to be regularly watered if rainwater is available to it outdoors.",
        "fertilization": "Common nipplewort can grow both in nutrient-rich and nutrient-poor soils and does not require fertilization to grow efficiently. If fertilization is preferred, a well-balanced all-purpose liquid fertilizer can be applied to the soil during planting.",
        "toxicity": "",
        "folder_num": 1364164
    },
    {
        "latin": "Lactuca serriola",
        "common": "Prickly lettuce",
        "description": "Prickly lettuce, in spite of its appearance, is the closest wild relative of cultivated lettuce. Even though it is widely considered a weed, it can be used in the kitchen. Young leaves of prickly lettuce are edible and the bitter milky latex can also be made into a condiment or to add flavor to salads. Consuming in large quantities could cause digestive upsets.",
        "watering": "Every week",
        "sunlight": "Full sun, Partial sun",
        "plantingTime": "Spring",
        "soil": "Sand",
        "wateringDetail": "Prickly lettuce should be watered regularly to maintain mesic soil. However, due to its weedy nature, the prickly lettuce is highly resilient to low water conditions due to its root structure which makes it resilient to droughts.",
        "fertilization": "As prickly lettuce is a weed, it does not need consistent fertilizer save when gardeners seek to pull the plant out. However, to promote the growth of early specimens, gardeners may place fertilizer close to its wheat seed.",
        "toxicity": "Toxic to Humans",
        "folder_num": 1364173
    },
    {
        "latin": "Lupinus polyphyllus",
        "common": "Garden lupine",
        "description": "While it is cultivated as a garden flower in many places, the garden lupine is considered an invasive species in others. As a garden plant, the garden lupine is commonly used to attract bees and retain nitrogen in the soil. But in New Zealand, Argentina, and various countries in Europe, garden lupine are grown invasively and causing many ecological problems.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Summer",
        "soil": "Sand, Loam, Clay, Chalky, Alkaline",
        "wateringDetail": "Garden lupine grows in moist and well drained soils. While it can grow in dry soils as well, it prefers moisture. Gardeners should water regularly as the garden lupine grows best in full sun and will require adequate water.",
        "fertilization": "Garden lupine does not require fertilizer as excessive amounts of nutrients can cause excessive foliage growth and reduce the number of blooms. As garden lupine can absorb nitrogen from its atmosphere, ensuring it accesses this nutrient. Still, gardeners can consider an acidifying fertilizer to lower the pH of alkaline soils.",
        "toxicity": "",
        "folder_num": 1367432
    },
    {
        "latin": "Trachelospermum jasminoides",
        "common": "Star jasmine",
        "description": "Star jasmine is a popular ornamental and houseplant due to its fragrant smell and relative ease of growth. This versatile plant can grow in full sun, partial shade or complete shade, making it common in a variety of climates. It prefers to climb and is generally planted on walls or fences to allow for this natural upward growth. The star jasmine is also known to attract pollinators such as bees.",
        "watering": "Every week",
        "sunlight": "Partial sun",
        "plantingTime": "Spring, Fall",
        "soil": "Loam, Sand, Chalky, Clay, Sandy loam, Acidic, Neutral, Alkaline",
        "wateringDetail": "Star jasmine requires plenty of water during the growing season but is rarely thirsty during fall and winter. How often to water the plant depends on the heat and climate conditions, so you might water it every three weeks in a damp climate or every ten days or so in hotter locations. It is always best to first check the dryness of the soil.",
        "fertilization": "Star jasmine only needs to be fertilized during its spring and summer growth period, and may not need to be fertilized at all when grown in nutrient-rich soils outdoors. Mulching the soil at the start of the season provides added nutrients and using slow-release fertilizer granules is a simple way to fertilize the plant once a year.",
        "toxicity": "",
        "folder_num": 1369887
    },
    {
        "latin": "Tagetes erecta",
        "common": "African marigold",
        "description": "African marigold is a common garden plant with bright orange or red flowers. Its use in decorative and ceremonial gardens dates back to ancient Aztec civilizations. Not only does african marigold add bright colors, but it is also known to repel insects, rabbits, and deer thanks to its toxic latex.",
        "watering": "Twice per week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Summer, Fall",
        "soil": "Sand, Loam, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "The african marigold should be watered regularly during the summer growing season so the soil is kept moderately moist, but not soggy or wet. Overwatering will damage the floral blooms and cause them to drop off. This plant should be grown in well-draining soil and is considered to have average watering needs compared to other flowering species.",
        "fertilization": "The african marigold should be fertilized with an organic fertilizer like compost during the planting season. During the active growing season, the plant should be fertilized with a well-balanced liquid mineral fertilizer. Avoid overfertilization to prevent floral bloom damage.",
        "toxicity": "",
        "folder_num": 1374048
    },
    {
        "latin": "Cucurbita pepo",
        "common": "Field pumpkin",
        "description": "Field pumpkin are most commonly seen as decorations throughout the autumn and during the Halloween holiday, when they are carved and used as traditional jack-o'-lanterns. While the taste of field pumpkin flesh may not be ideal, eating the seeds after toasting them with a bit of salt can be a delicious treat!",
        "watering": "Twice per week",
        "sunlight": "Full sun",
        "plantingTime": "Late winter",
        "soil": "Loam, Clay, Sand, Chalky, Neutral",
        "wateringDetail": "Field pumpkin is a thirsty plant that will require at least one inch of water per week, often more as they are fruiting. The leaves of these plants are sensitive to rot and disease, so you should try to keep them dry even while watering - spread your water in a circle around the base of the plant instead.",
        "fertilization": "Field pumpkin does well in rich soil and usually responds best to multiple fertilizer feedings per year. When the plant is first growing, you can use a nitrogen-heavy mix (e.g., 10-5-5) to encourage vigorous leaf and stem growth. Once flowering and fuiting occurs, however, you'll want to switch over to a potassium- and phosphorus-heavy mix (e.g., 10-20-20) to encourage a large, healthy crop. Liquid, granulated, or powder fertilizers are all fine, so long as they're not applied directly to the plant (which can cause nitrogen burns).",
        "toxicity": "",
        "folder_num": 1384485
    },
    {
        "latin": "Zamioculcas zamiifolia",
        "common": "Zanzibar gem",
        "description": "The zanzibar gem is a flowering green plant native to eastern Africa. It also gets the name emerald palm because of its bright, glossy color. Today, the zanzibar gem (Zamioculcas zamiifolia) is grown around the world as a houseplant, in part because it is easy to grow and care for. Though this plant is mildly toxic if ingested, its danger level is often overstated.",
        "watering": "Every 3 weeks",
        "sunlight": "Partial sun",
        "plantingTime": "All year around",
        "soil": "Sand, Loam, Chalky, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "The zanzibar gem should be allowed to dry out completely in between watering and should never sit in stagnant water; this plant will rot if its roots are allowed to sit in water after watering. This species can be watered once or twice during the dormant winter season and more frequently during the active growing season.",
        "fertilization": "The zanzibar gem will grow best if it is fertilized once a month with a well-balanced commercial houseplant fertilizer with a 20-20-20 formulation. A diluted liquid fertilizer works best for this species. This plant will grow faster with fertilizer, but it does not need to be fertilized to grow efficiently.",
        "toxicity": "",
        "folder_num": 1385937
    },
    {
        "latin": "Aegopodium podagraria",
        "common": "Ground elder",
        "description": "Aegopodium podagraria, commonly known as ground elder, is a herbaceous perennial native to Eurasia. Origin of its common name lies in the shape of its leaves and flowers, somewhat similar to elderberry. Ground elder is often cultivated as an ornamental plant. Due to its fast spread via rhizomes, it is considered an invasive species in certain countries.",
        "watering": "Every week",
        "sunlight": "Partial sun",
        "plantingTime": "Spring",
        "soil": "Sand, Loam, Clay, Chalky, Acidic, Neutral",
        "wateringDetail": "Ground elder grows in dry to medium well-drained soils. They have low to medium water requirements which makes it easy to maintain. When young, the ground elder may need extra water to help it establish.",
        "fertilization": "Ground elder does not require frequent fertilization for growth as it spreads easily. If exposed to poor soils, gardeners can treat it with mulch. For a flowering ground cover, utilize a fertilizer and apply it to its soil prior to planting.",
        "toxicity": "",
        "folder_num": 1389510
    },
    {
        "latin": "Alliaria petiolata",
        "common": "Garlic mustard",
        "description": "Alliaria petiolata, colloquially known as garlic mustard is a herbaceous biennial plant known for the garlic aroma and smell of its crushed leaves. It can be found in partially shaded and moist places like woodland edges, trails, hedges, and roadsides. Leaves of garlic mustard are used in European cuisine as a spice herb for salads and sauces.",
        "watering": "Every week",
        "sunlight": "Partial sun, Full sun, Full shade",
        "plantingTime": "Spring",
        "soil": "Sand, Loam, Clay, Chalky, Acidic",
        "wateringDetail": "Garlic mustard plants thrive in consistent moisture, and the soil around them should be watered whenever its surface dries out.",
        "fertilization": "Garlic mustard plants can grow in any quality of soil, and never need fertilizer. In fact, the trick is keeping it confined to where you want it to grow, so encouraging even more growth might be a bad idea.",
        "toxicity": "",
        "folder_num": 1392475
    },
    {
        "latin": "Hypericum calycinum",
        "common": "Creeping St. John's wort",
        "description": "The creeping St. John's wort (Hypericum calycinum) is a low, creeping, woody shrub commonly found on steep European slopes. The common name has roots in biblical texts, but has historically been applied to several different species; this particular species is likely not the same as the creeping St. John's wort mentioned in the bible.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Fall",
        "soil": "Sand, Loam, Clay, Chalky, Alkaline",
        "wateringDetail": "Rose of sharon needs soil that is kept slightly moist, and should be watered whenever the soil surface dries out. The period between waterings can shorten greatly if the plant spends a lot of time in direct sunlight, so keep an eye out. Water only at the root zone.",
        "fertilization": "Creeping St. John's wort can be fertilized using two different methods. Granular applications of a balanced fertilizer can be applied once a year to the soil around the base of the plant, either late in autumn after the leaves have dropped, or before bud break in early spring. Alternately, liquid fertilizer can be given during watering, four times a year from spring through midsummer. Container plantings need to be repotted into fresh soil roughly once a year to get all the nutrients they need.",
        "toxicity": "",
        "folder_num": 1393241
    },
    {
        "latin": "Lamium album",
        "common": "White deadnettle",
        "description": "White deadnettle (Lamium album) earns its common name from the fact that it superficially resembles the stinging nettle, but does not sting. The young greens are edible and have many culinary uses. In spring, white deadnettle produces small white flowers that are very attractive to pollinators, particularly bumblebees.",
        "watering": "Every week",
        "sunlight": "Partial sun",
        "plantingTime": "Spring",
        "soil": "Loam, Sand, Clay, Chalky, Acidic, Neutral, Slightly alkaline",
        "wateringDetail": "Average water needs,watering when the top 3 cm of soil has dried out.",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1393423
    },
    {
        "latin": "Lamium maculatum",
        "common": "Spotted Dead Nettles",
        "description": "Spotted Dead Nettles is most often known as a ground cover plant that does well in the shade. It has a habit of growing low to the ground in cold seasons and tall if conditions are warm. Although its name sounds sinister, the spotted Dead Nettles does not sting or burn like other nettles - hence the term ‘dead’ nettle. One cultivar of the species produces yellow leaves rather than the characteristic green-and-silver ones.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Summer",
        "soil": "Loam, Clay, Sand, Chalky, Acidic",
        "wateringDetail": "Spotted Dead Nettles should be watered to the extent that its soil is always moist, especially right after planting. Compared to other similar species, this plant is considered to have average watering needs. It should be watered again after the first two inches of soil have been allowed to dry completely.",
        "fertilization": "Spotted Dead Nettles can grow well without fertilizer. However, if fertilization is preferred, a mineral-based fertilizer should be applied in late spring. In addition, organic fertilizer like compost may be applied once during the winter season.",
        "toxicity": "",
        "folder_num": 1393425
    },
    {
        "latin": "Liriodendron tulipifera",
        "common": "Tulip poplar",
        "description": "The tulip poplar is not a poplar at all but is a member of the magnolia family. It gets its name from the tulip-shaped flowers that are green and yellow. It is the tallest Eastern hardwood and was prized by Native Americans as a favorite tree to use to make dugout canoes.",
        "watering": "Every 1-2 weeks",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Fall",
        "soil": "Loam, Sand, Clay, Chalky, Acidic, Neutral",
        "wateringDetail": "Naturally growing along stream banks, the tulip poplar requires good watering in well-drained soil. Failure to keep it moist can result in loss of foliage and weak wood. Gardeners should keep the tulip poplar reasonably moist to support its growth.",
        "fertilization": "Tulip poplar does well with fertilization and can grow double its size with the use of diammonium phosphate compared to other non-fertilized plants. Young specimens of tulip poplar are best supported with granular, liquid, or stake fertilizers. Gardeners can fertilize twice a month after dormancy and once during summer time, but stop fertilizing prior to dormancy.",
        "toxicity": "",
        "folder_num": 1393614
    },
    {
        "latin": "Anemone alpina",
        "common": "",
        "description": "",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1394382
    },
    {
        "latin": "Anemone hepatica",
        "common": "",
        "description": "",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1394420
    },
    {
        "latin": "Pelargonium inquinans",
        "common": "",
        "description": "",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1394454
    },
    {
        "latin": "Anemone nemorosa",
        "common": "Wood anemone",
        "description": "Wood anemone (Anemone nemorosa) is an herbaceous perennial species native to Europe. Wood anemone flowers in early spring. This species is known for the musky smell of the leaves. Wood anemone is also called the windflower, thimbleweed, and smell fox. Many cultivars of this species are planted in gardens.",
        "watering": "Every week",
        "sunlight": "Partial sun",
        "plantingTime": "Early fall, Mid fall",
        "soil": "Loam, Chalky, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "Moisture-loving, keep the soil moist but do not let water accumulate.",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1394460
    },
    {
        "latin": "Angelica sylvestris",
        "common": "Wild angelica",
        "description": "Wild angelica (Angelica sylvestris) is a large annual or short-lived perennial flowering plant native to Europe and central Asia. It is also present and invasive in Canada, and cultivated as a garden plant elsewhere. Known for its large flowerheads containing tiny individual flowers, wild angelica has many traditional uses.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1394591
    },
    {
        "latin": "Pyracantha coccinea",
        "common": "Scarlet firethorn",
        "description": "Scarlet firethorn (*Pyracantha coccinea*) is a semi-evergreen shrub featuring spiky branches that are covered abundantly by clustered white flowers, which contrast attractively with its lustrous, deep green foliage. It also bears vibrant crimson berries which are devoured by birds. From the genus name, *Pyracantha coccinea*, \"Pyr\" means \"fire\" in Greek, while \"Akantha\" means \"thorn\" in English, which apparently refers to the plant's thorny stems and crimson fruits.",
        "watering": "Every 1-2 weeks",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Fall",
        "soil": "Clay, Sand, Loam, Chalky, Acidic, Neutral, Alkaline",
        "wateringDetail": "Water Scarlet firethorn deeply whenever the first inch of soil around the plant dries out. Avoid overwatering to keep roots from rotting. Do not water in winter, while the plant is dormant, unless it is very dry.",
        "fertilization": "Fertilize scarlet firethorn plants with compost, rotted manure, or time-released 8-8-8 or 10-10-10 fertilizer, digging it into the soil around each plant and watering it in. Do this once a year in late winter.",
        "toxicity": "",
        "folder_num": 1394994
    },
    {
        "latin": "Tradescantia virginiana",
        "common": "Virginia spiderwort",
        "description": "Virginia spiderwort is called 'spiderwort' because its complex leaf formations have a spider-like shape. The fine hairs found on the plant’s stamen are frequently studied under the microscope in biology classes. The violet-blue flowers and elegant leaves make this North American native a popular ornamental plant.",
        "watering": "Every week",
        "sunlight": "Partial sun",
        "plantingTime": "Spring, Summer, Fall",
        "soil": "Clay, Chalky, Acidic, Neutral, Alkaline",
        "wateringDetail": "Virginia spiderwort flourishes in dry to moist soils that are well-drained. Therefore, this plant requires a moderate amount of water. When placed in full sun, the virginia spiderwort may require more water.",
        "fertilization": "Virginia spiderwort can be supported by composting their flower beds in early spring and fertilizing it once. If inside, gardeners may give virginia spiderwort liquid fertilizer in fall and spring twice.",
        "toxicity": "",
        "folder_num": 1396824
    },
    {
        "latin": "Anemone hupehensis",
        "common": "Anemone hupehensis",
        "description": "Anemone hupehensis is a plant that can last for a long time. The flowers are purple, pink, or white, depending on the cultivar. The leaves have a deeply marked margin with leaflets arranged like the spreading fingers of a hand. You can find this plant growing in lowland thickets, streamsides, and hilly regions of China.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "",
        "soil": "Neutral",
        "wateringDetail": "",
        "fertilization": "",
        "toxicity": "",
        "folder_num": 1397268
    },
    {
        "latin": "Cymbalaria muralis",
        "common": "Kenilworth ivy",
        "description": "The kenilworth ivy is a perennial and small flowering plant that grows on rocks and walls. The little scallops with tiny lilac-blue flowers bloom all summer long. The center of the flowers is yellow to direct or guide the honey bees where the nectar and pollen are. The flowers can be used as a temporary yellow dye.",
        "watering": "Twice per week",
        "sunlight": "Partial sun",
        "plantingTime": "Spring",
        "soil": "Sand, Clay, Loam, Chalky, Acidic, Neutral",
        "wateringDetail": "Water your Kenilworth ivy deeply up to 8 inches, soaking the ground. Plants may need more frequent watering during dry conditions. Be cautious not to overwater the plant to avoid root rot. Water when the first 2 inches of soil is dry and avoid wetting the foliage to reduce the risk of fungal growth.",
        "fertilization": "To give your kenilworth ivy an extra boost for the growing season, add organic compost to the soil when planting. Once your plant is established, it can benefit from a spring application of fertilizer and another application mid-growing season. Look for a balanced all-purpose fertilizer to support extra blooms.",
        "toxicity": "",
        "folder_num": 1397364
    },
    {
        "latin": "Tradescantia zebrina",
        "common": "Silver inch plant",
        "description": "The silver inch plant is a popular trailing plant known for its attractive foliage with zebra-like stripes of green, silver, and purple. Tradescantia zebrina is very easy to care for and can be hung or placed indoors. The plant grows fast; the creeping stems bear roots along the way, making it suitable as ground cover.",
        "watering": "Every week",
        "sunlight": "Full shade",
        "plantingTime": "Spring, Summer, Fall",
        "soil": "Sand, Loam, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "The silver inch plant should be watered deeply with each watering, but its soil should be allowed to partially dry out in between waterings. This plant does not do well if its soil is overly wet or overly dry for long periods of time, so striking a balance is important. During the dormant winter season, watering frequency can be reduced by half.",
        "fertilization": "The silver inch plant does not require fertilizer to grow well. If fertilization is preferred, a weak, generall-purpose commercial fertilizer should be used. This fertilizer should be applied only during the active growing season between spring and fall about once every few weeks.",
        "toxicity": "",
        "folder_num": 1398178
    },
    {
        "latin": "Perovskia atriplicifolia",
        "common": "Russian sage",
        "description": "Russian sage is an attractive species of sage with a strong scent. Certain cultures in Kashmir use the flowers to create textile dyes. A biopesticide has been developed from russian sage essential oil which protects against ants and certain beetles. The plant is also being investigated for its ability to draw heavy metals out of contaminated soil.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Fall",
        "soil": "Sand, Loam, Acidic, Neutral, Alkaline",
        "wateringDetail": "Once you have planted Russian sage it is recommended to water it weekly through that first summer, giving a little more if it is dry weather. Russian sage can be watered sparingly in following summers as it thrives in dry conditions. To avoid root rot, do not make the soil soggy.",
        "fertilization": "It is advised to only fertilize russian sage once a year, preferably after it has been pruned. A sprinkling around the base of a couple of tablespoons of slow-release fertilizer should be enough. 5-10-5 fertilizer or all-purpose fertilizer is appropriate.",
        "toxicity": "",
        "folder_num": 1398592
    },
    {
        "latin": "Barbarea vulgaris",
        "common": "Yellow rocket",
        "description": "Yellow rocket is a biannual herb endemic to Europe. Saint Barbara, the patron saint of artillerymen and mining workers, inspired the name Barbarea. This plant's leaves are edible, whether raw or cooked. It also has a natural resistance to several bug species.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Summer, Early fall",
        "soil": "Sand, Loam, Clay, Chalky, Acidic, Neutral",
        "wateringDetail": "Yellow rocket is a water-loving plant that can't thrive in dry conditions. Actually, it thrives best in waterlogged soil or even in shallow water. It needs regular watering and constantly moist soil. Water the plant when the soil starts drying out and don't let it dry completely.",
        "fertilization": "Yellow rocket doesn't have any particular fertilizing requirements. Supplemental feeding is needed only if the soil lacks vital nutrients such as nitrogen, potassium, and phosphorus. If your plant is dark colored and stunted, you can apply fertilizer. A balanced, water-soluble fertilizer diluted in water is a good choice.",
        "toxicity": "Toxic to Humans",
        "folder_num": 1400100
    },
    {
        "latin": "Tradescantia pallida",
        "common": "Purple heart",
        "description": "Tradescantia pallida is an evergreen perennial trailing plant, colloquially known as purple heart. This beautiful perennial is famous for its spectacular deep purple, pointed leaves. Purple heart is a common houseplant, but it is also often used in landscaping as a bedding plant.",
        "watering": "Every 1-2 weeks",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Summer, Fall",
        "soil": "Sand, Loam, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "The purple heart should be watered thoroughly, and then the soil allowed to dry out substantially in between watering. When the top two to three inches of soil are dry, it is time to water again. During the dormant winter season, this plant should be watered less often.",
        "fertilization": "The purple heart should be fertilized once a month during the active growing period between late spring and late summer. It does not need to be fertilized in the dormant winter months. An all-purpose floral fertilizer should be used to fertilize this species.",
        "toxicity": "",
        "folder_num": 1408774
    },
    {
        "latin": "Schefflera arboricola",
        "common": "Dwarf umbrella tree",
        "description": "Dwarf umbrella tree (*Schefflera arboricola*) is an evergreen, multi-stemmed shrub native to China. It is commonly grown as a houseplant or a garden plant in milder climates for its decorative palmate compound leaves. The leaves contain calcium oxalates, which can damage internal organs when ingested. It shouldn't be confused with the Australian umbrella tree, *Schefflera actinophylla*.",
        "watering": "Every 1-2 weeks",
        "sunlight": "Partial sun",
        "plantingTime": "Spring, Summer, Fall",
        "soil": "Loam, Sand, Chalky, Clay, Sandy loam, Acidic, Neutral, Alkaline",
        "wateringDetail": "The dwarf umbrella tree should be watered regularly, but sparingly. The soil should be allowed to partially dry out between watering and kept lightly moist. This species should not be allowed to sit in standing water in between watering. Overwatering is a bigger threat to this species than drying out.",
        "fertilization": "The dwarf umbrella tree can be fertlized with a well-balanced liquid houseplant fertilizer for foliage plants. A balanced fertilizer with an 8-8-8 or 10-10-10 nitrogen, phosphorous, and potassium content is appropriate. The dwarf umbrella tree can be fertilized every two to three weeks during the active growing season between spring and fall. During the dormant winter season, fertilize less frequently.",
        "toxicity": "Toxic to Pets",
        "folder_num": 1408961
    },
    {
        "latin": "Anthurium andraeanum",
        "common": "Flamingo flower",
        "description": "Flamingo flower (Anthurium andraeanum) is an ornamental perennial plant, famous for its pink or bright red heart-shaped flowers with very prominent pistils. Aside from its decorative attributes, flamingo flower is said to have excellent air-purifying properties.",
        "watering": "Every week",
        "sunlight": "Partial sun",
        "plantingTime": "Spring, Fall",
        "soil": "Loam, Sand, Clay, Acidic, Neutral, Alkaline",
        "wateringDetail": "The flamingo flower should be watered infrequently, but thoroughly during the active growing season between summer and fall. The soil should be allowed to partially dry out in between watering. When the first inch of topsoil is dry, it is appropriate to water the flamingo flower. Overwatering this species may cause yellowing of the leaves or fatal root rot in the root system.",
        "fertilization": "The flamingo flower should be fertilized every other month during the active growing season between spring and fall. A well-balanced, water-soluble fertilizer formulated for houseplants is ideal for this species. For optimal results, the fertilizer should be diluted to one-fourth of its strength before application.",
        "toxicity": "Toxic to Humans",
        "folder_num": 1409238
    },
    {
        "latin": "Fittonia albivenis",
        "common": "Nerve plant",
        "description": "The nerve plant is an excellent houseplant that is native to South American rainforests. The patterns on the leaves are highly decorative, and the plant needs to be maintained at a temperature above 13 ℃ and watered regularly. This Fittonia albivenis can be difficult to grow, so it is recommended that you purchase it directly from a nursery.",
        "watering": "Every week",
        "sunlight": "Partial sun",
        "plantingTime": "Spring, Summer, Fall",
        "soil": "Loam, Moderately acidic, Slightly acidic",
        "wateringDetail": "The nerve plant should be watered moderately and its soil should be allowed to dry out in between watering. Overwatering can cause root rot as well as leaf spot disease. Wilting, yellow leaves are a symptom of overwatering. In addition, if the plant is allowed to dry out for too long, its structure may collapse. A balanced, consistent watering schedule is key when caring for this plant.",
        "fertilization": "The nerve plant should be fertilized with a well-balanced liquid fertilizer formulated for tropical plants. This species does well if a diluted 5-5-5 nitrogen, phosphorous, and potassium formulated fertilizer is added during its watering schedule. In the growing season, monthly fertilization will be sufficient to feed this species.",
        "toxicity": "",
        "folder_num": 1418146
    },
    {
        "latin": "Pelargonium zonale",
        "common": "Horseshoe geranium",
        "description": "Horseshoe geranium can be identified by looking for horseshoe-shaped patterns of color, or “zones” within the leaves. The bright blooms are attractive to bees, butterflies, and birds and come in many colors, including red, pink, salmon, and more. These plants are easy to grow outside in your yard or indoors in containers.",
        "watering": "Every week",
        "sunlight": "Full sun",
        "plantingTime": "Spring, Summer, Fall",
        "soil": "Sand, Neutral, Alkaline",
        "wateringDetail": "Horseshoe geranium requires infrequent, deep watering. Allow the soil to dry out between waterings and water thoroughly when dried. During hot spells, this plant may require a more frequent watering schedule. Cut back on water during the winter.",
        "fertilization": "During the growing season, fertilize your this plant every two weeks. Use liquid, general-purpose fertilizer to promote healthy growth and profuse blooming. Don't fertilize horseshoe geranium in winter while it is dormant.",
        "toxicity": "Toxic to Pets",
        "folder_num": 1435714
    }
]